[
  {
    "id": "-8079399162138855443",
    "title": "Manus AI is one of the most exciting new AI experiences —and it’s just getting started. We’re proud ...",
    "content": "Manus AI is one of the most exciting new AI experiences —and it’s just getting started. We’re proud to partner with Manus through Azure AI Foundry to help them scale securely, globally, and fast. Thanks Red Xiao and Tao Cheung on the wonderful collaboration.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.289969",
    "published_date": "2025-06-02T19:31:20.289969",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290117"
  },
  {
    "id": "4944883605915597428",
    "title": "Aurora is a new foundation model from Microsoft Research that goes beyond weather forecasting, deliv...",
    "content": "Aurora is a new foundation model from Microsoft Research that goes beyond weather forecasting, delivering faster, more accurate predictions of environmental events. Awesome to see this breakthrough published in Nature Magazine. https://lnkd.in/d8GVp_JN",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290138",
    "published_date": "2025-06-02T19:31:20.290138",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290147"
  },
  {
    "id": "2405594070586899418",
    "title": "The agentic web is reshaping the entire tech stack, and we are creating new opportunity for devs at ...",
    "content": "The agentic web is reshaping the entire tech stack, and we are creating new opportunity for devs at every layer. You can watch my full Build keynote here: https://lnkd.in/gG9fN5SC",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290156",
    "published_date": "2025-06-02T19:31:20.290156",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290162"
  },
  {
    "id": "-311392765592061795",
    "title": "Thanks for joining us at Build, Sam! Great to talk to you about SWE agents and how the role of devel...",
    "content": "Thanks for joining us at Build, Sam! Great to talk to you about SWE agents and how the role of developers is evolving.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290169",
    "published_date": "2025-06-02T19:31:20.290169",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290175"
  },
  {
    "id": "-1707857385634728379",
    "title": "Great to have Jensen Huang at Build to talk about our partnership and how we are building and scalin...",
    "content": "Great to have Jensen Huang at Build to talk about our partnership and how we are building and scaling the largest AI supercomputer in the world on Azure. Watch our full conversation here: http://aka.ms/buildnvidia",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290181",
    "published_date": "2025-06-02T19:31:20.290181",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290186"
  },
  {
    "id": "-6845078855392964489",
    "title": "Stanford Medicine is orchestrating multiple agents to connect medical data, clinical trials, and mor...",
    "content": "Stanford Medicine is orchestrating multiple agents to connect medical data, clinical trials, and more – all with the goal of delivering more effective cancer care. Incredible to see in action.\n\nLearn more about our new healthcare agent orchestrator: https://lnkd.in/gGJd-uQG",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290194",
    "published_date": "2025-06-02T19:31:20.290194",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290199"
  },
  {
    "id": "5722637148076704915",
    "title": "Today, at Microsoft Build we showed you how we are building the open agentic web. It is reshaping ev...",
    "content": "Today, at Microsoft Build we showed you how we are building the open agentic web. It is reshaping every layer of the stack, and our goal is simple: help every dev build apps and agents that empower people and orgs everywhere. Here are 5 big things we announced today: \n\n1. Coding agent: We are taking GitHub Copilot from being a pair programmer to peer programmer. You now have a full coding agent built right into GitHub. You can assign it issues – whether it’s bug fixes, new features, or ongoing code maintenance. And it will complete these tasks autonomously. \n\n2. Copilot tuning: Copilot can now learn your company’s unique tone and language. It is all about taking that expertise you have as a firm and further amplifying it so everyone has access.\n\n3. Agent factory: Foundry is the complete app platform for building apps and agents. We are adding support for more models from Grok, Hugging Face, Meta, Mistral, and more. Plus: Agentic retrieval in Azure AI Search, Foundry Agent Service, integration with Copilot Studio, and more.  \n\nAnd we are ensuring the tools you already use for identity, management, and security will now all extend to agents too. \n\n4. NL Web: This is a new open project that lets you use natural language to interact with any website. Think of it like HTML for the agentic web.\n \n5. Microsoft Discovery: We’re bringing together the full tech stack to help speed up science itself. Discovery uses agents to generate ideas, simulate results, and learn. A great example is this promising candidate for a coolant that doesn’t rely on forever chemicals.\n\nYou can read more about all of this – and much more – here:  https://lnkd.in/gik2mTNb",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290210",
    "published_date": "2025-06-02T19:31:20.290210",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290217"
  },
  {
    "id": "1559810428371248278",
    "title": "Microsoft Build has arrived in Seattle and we're just about ready to push to prod. ✅",
    "content": "Microsoft Build has arrived in Seattle and we're just about ready to push to prod. ✅\n\nIt all kicks off tomorrow—get ready to experience innovation, connection, and the future of development. Tune in live for the opening keynote tomorrow, May 19th, at 9:05am PT: https://lnkd.in/eE7A-xpD",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290223",
    "published_date": "2025-06-02T19:31:20.290223",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290228"
  },
  {
    "id": "1101589375438882072",
    "title": "Today I joined others in testifying before the Senate Commerce Committee. As we discussed, it’s esse...",
    "content": "Today I joined others in testifying before the Senate Commerce Committee. As we discussed, it’s essential for the U.S. to continue to invest in both AI innovation and diffusion, while supporting the export of AI to American friends and allies. https://lnkd.in/ea3M2Grh",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290234",
    "published_date": "2025-06-02T19:31:20.290234",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290239"
  },
  {
    "id": "6888178986110012934",
    "title": "Open protocols like A2A and MCP are key to enabling the agentic web. With A2A support coming to Copi...",
    "content": "Open protocols like A2A and MCP are key to enabling the agentic web. With A2A support coming to Copilot Studio and Foundry, customers can build agentic systems that interoperate by design.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290246",
    "published_date": "2025-06-02T19:31:20.290246",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290250"
  },
  {
    "id": "-2468473143303738050",
    "title": "Today, we’re also introducing the next wave of Windows experiences designed to adapt to you includin...",
    "content": "Today, we’re also introducing the next wave of Windows experiences designed to adapt to you including adding an agent to Settings, more actions in Click to Do and improved Windows search, updates to Narrator and more! Everything we are building is about making your Windows experience more effortless and personal. ✨ https://lnkd.in/gFY-tUuj",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290257",
    "published_date": "2025-06-02T19:31:20.290257",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290262"
  },
  {
    "id": "792357506296753892",
    "title": "I think I would’ve gotten that one! Fun to see Majorana-1 on Jeopardy!",
    "content": "I think I would’ve gotten that one! Fun to see Majorana-1 on Jeopardy!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290268",
    "published_date": "2025-06-02T19:31:20.290268",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290273"
  },
  {
    "id": "-4155202992784644362",
    "title": "We’ve developed a new way to measure the full environmental impact of DC cooling, from energy and ca...",
    "content": "We’ve developed a new way to measure the full environmental impact of DC cooling, from energy and carbon to water use. It’s helping us make smarter decisions, and we’re sharing it with the industry. Check it out in Nature Magazine.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290279",
    "published_date": "2025-06-02T19:31:20.290279",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290284"
  },
  {
    "id": "1499214879205519183",
    "title": "Another big step forward for our SLM Phi family, with new reasoning models that once again redefine ...",
    "content": "Another big step forward for our SLM Phi family, with new reasoning models that once again redefine what is possible with small and efficient AI.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290290",
    "published_date": "2025-06-02T19:31:20.290290",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290295"
  },
  {
    "id": "4821679891742174133",
    "title": "It’s been a busy few weeks – between today’s earnings and some of our recent announcements. Here are...",
    "content": "It’s been a busy few weeks – between today’s earnings and some of our recent announcements. Here are a few things I wanted to highlight:\n\nWe are riding multiple compounding S curves in pre-training, inference time, and systems design, driving model performance that is doubling every 6 months. \n\nAzure is the infrastructure layer for AI, optimized across every layer: DCs, silicon, systems software, and models to lower costs and increase performance. We are delivering more performance per megawatt, lower cost per token, and faster dock-to-live times. \n\nFrontier firms are incorporating AI into everyday workflows, transforming work and work artifacts. Microsoft 365 Copilot is now being used by hundreds of thousands of customers across industries, up 3X year-over-year. \n\nI’m especially excited about our new Researcher and Analyst agents, like having a highly trained expert on call 24/7.\n\nAnd our customers have created over 1 million agents of their own using SharePoint and Copilot Studio.\n\nOn the consumer side: Our ad revenue surpassed $20 billion over the past year. Only at Microsoft could that almost get overlooked!\n\nLinkedIn continues to grow fast, with double-digit membership gains. And we again took share across Bing and Edge. And we are building daily engagement and successful sessions with our Copilot app, which got a big update earlier this month.\n\nAnd, yes, blocks can be stars: Minecraft weekly active users jumped 75% year-over-year after the movie release. \n\nYou can read more about our results here: https://lnkd.in/gjWnuT9H",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290305",
    "published_date": "2025-06-02T19:31:20.290305",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290311"
  },
  {
    "id": "-7342866104857307334",
    "title": "Big day for Microsoft 365 Copilot: I’m really excited about our latest update. Copilot has truly bec...",
    "content": "Big day for Microsoft 365 Copilot: I’m really excited about our latest update. Copilot has truly become the UI for AI – and for me, it’s the scaffolding for my workday. Here are four new features I’ve especially been enjoying:\n\n1) Agents: Our new Researcher and Analyst agents have become my go-to 24/7 experts. I use them all the time.\n\nWith Researcher, the multi-step reasoning aggregates and synthesizes information from the web and all enterprise data and creates super insightful reports on any topic or project. \n\nAnd Analyst can turn raw data across multiple sources into deep insights, forecasts or a great visualization. \n\nWith our new Agent Store, you can easily find a range of additional agents from our many partners too. \n\nAnd with Copilot Studio you can create your own agents. It’s as straightforward as creating a Word doc or Excel sheet.\n\n2) Notebooks: With Web + Work + Pages, you can ideate with AI and collaborate with other people. It has entirely changed my workflow. \n\nAnd now with Notebooks, I can organize all of my heterogeneous data for a project, whether it’s Pages, docs, websites, team meetings – and Copilot will ground itself just on that content. \n\nAnd this might be the best part: I can turn it all into a new modality like an audio overview.\n\nFor example, I can collect all the latest things I’m reading about agents and agent frameworks, and then I can listen to it.\n\n3) Search: We have added new comprehensive search capability that spans all your apps, including third-party sources from ServiceNow to Google Drive, Slack, Confluence, Jira, and more, breaking down silos across the enterprise.\n\nSearch brings back both a Copilot answer, as well as all of the source data from all of these artifacts. \n\n4) Create: This one is fun. Turn a PowerPoint into an explainer video, or generate an image from a prompt in Copilot with just a few clicks.\n\nWe’ve also added new features to make Copilot even more personalized to you, plus a redesigned app built for human-agent collaboration.\n\nLearn more about our update here: https://lnkd.in/g_FGnKZA",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290323",
    "published_date": "2025-06-02T19:31:20.290323",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290329"
  },
  {
    "id": "7070843090554473221",
    "title": "A great example of what's possible when someone connects their passion with their purpose to make a ...",
    "content": "A great example of what's possible when someone connects their passion with their purpose to make a real difference.\n \nDxGPT, a rare disease diagnostic tool, is now live, showing how AI can be applied to truly improve lives.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290336",
    "published_date": "2025-06-02T19:31:20.290336",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290341"
  },
  {
    "id": "-8371288818603809260",
    "title": "A huge thank you to all of the security researchers who joined our inaugural Quest! Your work is hel...",
    "content": "A huge thank you to all of the security researchers who joined our inaugural Quest! Your work is helping to make the world a safer place.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290347",
    "published_date": "2025-06-02T19:31:20.290347",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290352"
  },
  {
    "id": "-581259252803175562",
    "title": "Security remains our top priority as a company, and we're sharing an update on the progress we are m...",
    "content": "Security remains our top priority as a company, and we're sharing an update on the progress we are making across the objectives we outlined a year ago.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290358",
    "published_date": "2025-06-02T19:31:20.290358",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290363"
  },
  {
    "id": "-1706855474373813434",
    "title": "Pope Francis' unwavering compassion, humility, and commitment to social justice have inspired millio...",
    "content": "Pope Francis' unwavering compassion, humility, and commitment to social justice have inspired millions around the world. He will be deeply missed.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290369",
    "published_date": "2025-06-02T19:31:20.290369",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290373"
  },
  {
    "id": "-7009300520636619347",
    "title": "More big updates to Foundry today: o3 and o4-mini from OpenAI are both simul-shipping, delivering a ...",
    "content": "More big updates to Foundry today: o3 and o4-mini from OpenAI are both simul-shipping, delivering a leap forward in AI reasoning.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290379",
    "published_date": "2025-06-02T19:31:20.290379",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290384"
  },
  {
    "id": "-4160318749062404915",
    "title": "Starting today, we’re bringing computer use agent capabilities to Copilot Studio – enabling anyone t...",
    "content": "Starting today, we’re bringing computer use agent capabilities to Copilot Studio – enabling anyone to build agents that take action on the UI across both desktop and web apps. Excited to see what this unlocks!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290390",
    "published_date": "2025-06-02T19:31:20.290390",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290395"
  },
  {
    "id": "-7532813048005305304",
    "title": "We’re bringing the latest GPT-4.1 models from OpenAI to Foundry, representing significant advancemen...",
    "content": "We’re bringing the latest GPT-4.1 models from OpenAI to Foundry, representing significant advancements in coding, instruction following, and long-context processing. Big upgrades for devs building with AI.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290401",
    "published_date": "2025-06-02T19:31:20.290401",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290406"
  },
  {
    "id": "5991841536975165655",
    "title": "Thrilled to bring Meta’s Llama 4 Scout and Maverick to Foundry today, as we continue to make Azure t...",
    "content": "Thrilled to bring Meta’s Llama 4 Scout and Maverick to Foundry today, as we continue to make Azure the platform of choice for the world’s most advanced AI models.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290412",
    "published_date": "2025-06-02T19:31:20.290412",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290417"
  },
  {
    "id": "-8974238970610706637",
    "title": "With Actions, Memory, Deep Research, Pages and more big updates, we are evolving Copilot into a more...",
    "content": "With Actions, Memory, Deep Research, Pages and more big updates, we are evolving Copilot into a more capable, more personal AI companion.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290423",
    "published_date": "2025-06-02T19:31:20.290423",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290427"
  },
  {
    "id": "4484387232861719850",
    "title": "Microsoft has always been a platform and partner-first company, and I am deeply grateful to our cust...",
    "content": "Microsoft has always been a platform and partner-first company, and I am deeply grateful to our customers, our partners, and developers, as well our 1.6 million employees, past and present, who have connected their passion with our purpose to get us where we are today. It’s all of you who will continue to build this company to have impact everywhere around the world for the next 50 years and beyond. From the bottom of my heart, a big thank you.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290434",
    "published_date": "2025-06-02T19:31:20.290434",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290439"
  },
  {
    "id": "6194325962243774041",
    "title": "I'm eternally grateful to Bill and Steve and to Paul for what you've meant to me personally and the ...",
    "content": "I'm eternally grateful to Bill and Steve and to Paul for what you've meant to me personally and the vision you had to build this extraordinary company of ours that I've had the privilege to be a part of. \n \nThank You for your leadership, your passion, and for building the Microsoft that we know today. A company that has truly changed the world.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290446",
    "published_date": "2025-06-02T19:31:20.290446",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290451"
  },
  {
    "id": "-2100435320111855828",
    "title": "You really know intelligence has been commoditized when CEOs start vibe coding!",
    "content": "You really know intelligence has been commoditized when CEOs start vibe coding!\n\nGitHub Copilot Agent Mode & MCP support is rolling out to all VS Code users: https://lnkd.in/g6s8HDC2",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290457",
    "published_date": "2025-06-02T19:31:20.290457",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290462"
  },
  {
    "id": "-4338530640697551890",
    "title": "Three Microsoft CEOs walk into a room on Microsoft’s 50th anniversary … and are interviewed by Copil...",
    "content": "Three Microsoft CEOs walk into a room on Microsoft’s 50th anniversary … and are interviewed by Copilot!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290468",
    "published_date": "2025-06-02T19:31:20.290468",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290472"
  },
  {
    "id": "4833700459608676083",
    "title": "From block to blockbuster. Huge congrats to Mojang Studios, Warner Bros. Pictures, and Legendary Ent...",
    "content": "From block to blockbuster. Huge congrats to Mojang Studios, Warner Bros. Pictures, and Legendary Entertainment on crafting something truly epic.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290478",
    "published_date": "2025-06-02T19:31:20.290478",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290482"
  },
  {
    "id": "-1920424086909189292",
    "title": "It was wonderful to be back in Korea and Japan this week spending time with customers, partners, and...",
    "content": "It was wonderful to be back in Korea and Japan this week spending time with customers, partners, and employees and seeing our mission in action. From meeting with students in Tokyo who participated in an AI hackathon, to announcing the expansion of our AI capacity in the country, launching a new skilling initiative in Korea with our partner KT, and meeting developers at a showcase in Seoul, it was inspiring to see firsthand how our platforms and tools are creating new economic opportunities and empowering people and organizations across every sector in both countries. We are deeply grateful to the many customers and partners who have put their trust in us as they transform in this era of AI.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290488",
    "published_date": "2025-06-02T19:31:20.290488",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290493"
  },
  {
    "id": "2656402531538058700",
    "title": "Our new Researcher and Analyst agents in Microsoft 365 Copilot, as well as new reasoning capabilitie...",
    "content": "Our new Researcher and Analyst agents in Microsoft 365 Copilot, as well as new reasoning capabilities in Copilot Studio, will completely change the scale and scope of what any one of us can do at work:",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290500",
    "published_date": "2025-06-02T19:31:20.290500",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290504"
  },
  {
    "id": "8945454329185090033",
    "title": "With our SLM Phi, flight attendants at Japan Airlines are spending less time on paperwork and more t...",
    "content": "With our SLM Phi, flight attendants at Japan Airlines are spending less time on paperwork and more time with passengers... something I saw a great demo of today in Tokyo!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290511",
    "published_date": "2025-06-02T19:31:20.290511",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290515"
  },
  {
    "id": "-2015872762130020808",
    "title": "It's been fantastic to see firsthand in Korea how Amorepacific is using Azure AI Foundry to deliver ...",
    "content": "It's been fantastic to see firsthand in Korea how Amorepacific is using Azure AI Foundry to deliver personalized advice:",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290522",
    "published_date": "2025-06-02T19:31:20.290522",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290526"
  },
  {
    "id": "-1572648271900282009",
    "title": "Our Researcher and Analyst agents are like having a highly skilled expert on call for you 24/7 acros...",
    "content": "Our Researcher and Analyst agents are like having a highly skilled expert on call for you 24/7 across your work data and the web. Excited to bring reasoning to Microsoft 365 Copilot & Copilot Studio today. https://lnkd.in/gj_5Siq2",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290533",
    "published_date": "2025-06-02T19:31:20.290533",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290537"
  },
  {
    "id": "-5306389334609789912",
    "title": "The speed, scale, and frequency of cyberattacks are outpacing the capabilities of human defenders al...",
    "content": "The speed, scale, and frequency of cyberattacks are outpacing the capabilities of human defenders alone. Today we're expanding Security Copilot with security agents to help address routine security and IT tasks.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290544",
    "published_date": "2025-06-02T19:31:20.290544",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290548"
  },
  {
    "id": "4743850446754535982",
    "title": "From GA of NVIDIA GB200 on Azure, to NVIDIA NIM support on Azure AI Foundry and more, great to see h...",
    "content": "From GA of NVIDIA GB200 on Azure, to NVIDIA NIM support on Azure AI Foundry and more, great to see how we continue to push the bounds of agentic AI with the team at NVIDIA.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290554",
    "published_date": "2025-06-02T19:31:20.290554",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290559"
  },
  {
    "id": "-7915263139339153356",
    "title": "Gaming is for everyone! That's why we've partnered with the disability community to introduce our Xb...",
    "content": "Gaming is for everyone! That's why we've partnered with the disability community to introduce our Xbox Adaptive Joystick to help ensure that anyone who wants to can join in on the fun. https://lnkd.in/gtwwM-Ct",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290565",
    "published_date": "2025-06-02T19:31:20.290565",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290569"
  },
  {
    "id": "7489831920735830059",
    "title": "Super excited about Adobe's new Microsoft 365 Copilot agents, which bring the best of Adobe right in...",
    "content": "Super excited about Adobe's new Microsoft 365 Copilot agents, which bring the best of Adobe right into your flow of work. \n \nCheck it out: https://lnkd.in/gB2vrc7c",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290576",
    "published_date": "2025-06-02T19:31:20.290576",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290581"
  },
  {
    "id": "1374840725233543243",
    "title": "With Copilot for Gaming, you can jump back into games faster, get real-time coaching, and stay conne...",
    "content": "With Copilot for Gaming, you can jump back into games faster, get real-time coaching, and stay connected... all on your own terms. Excited for what the team has in store! \n\nLearn more: https://lnkd.in/gw4_-W2w",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290587",
    "published_date": "2025-06-02T19:31:20.290587",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290591"
  },
  {
    "id": "8851805738409925817",
    "title": "Great examples here of organizations of every size in every industry using Copilot and agents to ach...",
    "content": "Great examples here of organizations of every size in every industry using Copilot and agents to achieve some pretty remarkable results. The structure of the firm as we know it is evolving rapidly, in real time!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290598",
    "published_date": "2025-06-02T19:31:20.290598",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290602"
  },
  {
    "id": "3384419735863989629",
    "title": "This has become my new workflow to prep for customer meetings:",
    "content": "This has become my new workflow to prep for customer meetings:\n\nWith Sales Chat, I think with AI and collaborate with my team, all within the tools I use each day. No more logging into CRM, copy-pasting data, importing/exporting, generating reports, or juggling multiple apps. I just use the agent to surface the most important data and insights for the meeting.\n\nSuper excited for more people to try it out, along with our new Sales Agent!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290609",
    "published_date": "2025-06-02T19:31:20.290609",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290614"
  },
  {
    "id": "9019888400220448950",
    "title": "No one becomes a clinician to do paperwork, but it's becoming a bigger and bigger administrative bur...",
    "content": "No one becomes a clinician to do paperwork, but it's becoming a bigger and bigger administrative burden, taking time and attention away from actually treating and supporting patients.\n\nThat’s why we’re introducing Microsoft Dragon Copilot, the industry’s first AI assistant for clinical workflow. Check it out: https://lnkd.in/gNxEaRuf",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290622",
    "published_date": "2025-06-02T19:31:20.290622",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290626"
  },
  {
    "id": "9065536132810136983",
    "title": "Major upgrades for Azure AI Foundry today: ",
    "content": "Major upgrades for Azure AI Foundry today: \n\nGPT-4.5 is now in preview, demonstrating a big step forward in both pre-training and post-training scale. \n\nPlus, new models from Cohere, Stability, and Microsoft. As AI becomes core to building every product, we’re also rolling out new capabilities for distillation, fine-tuning and network isolation for our agent service. \n\nThe app server for AI is here! \n\nLearn more: https://lnkd.in/gswHbTn2",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290673",
    "published_date": "2025-06-02T19:31:20.290673",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290682"
  },
  {
    "id": "-3218090625369683125",
    "title": "More big updates today for our Phi family of SLMs: Phi-4 multimodal and Phi-4 mini. Can't wait to se...",
    "content": "More big updates today for our Phi family of SLMs: Phi-4 multimodal and Phi-4 mini. Can't wait to see what you build.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290686",
    "published_date": "2025-06-02T19:31:20.290686",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290689"
  },
  {
    "id": "-6566791941717567688",
    "title": "A fantastic example of AI's impact on agriculture.",
    "content": "A fantastic example of AI's impact on agriculture.\n\nLearn more here: https://lnkd.in/gVRkp5HX",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290692",
    "published_date": "2025-06-02T19:31:20.290692",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290694"
  },
  {
    "id": "-7842563994324909421",
    "title": "We’re taking our latest AI research breakthroughs and putting them in the hands of devs everywhere, ...",
    "content": "We’re taking our latest AI research breakthroughs and putting them in the hands of devs everywhere, with Azure AI Foundry Labs.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290696",
    "published_date": "2025-06-02T19:31:20.290696",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290698"
  },
  {
    "id": "8696127254239246155",
    "title": "If you thought AI-generated text, images, and video were cool, just imagine entire interactive envir...",
    "content": "If you thought AI-generated text, images, and video were cool, just imagine entire interactive environments like games!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290700",
    "published_date": "2025-06-02T19:31:20.290700",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290702"
  },
  {
    "id": "1142469276379342035",
    "title": "A couple reflections on the quantum computing breakthrough we just announced...",
    "content": "A couple reflections on the quantum computing breakthrough we just announced...\n\nMost of us grew up learning there are three main types of matter that matter: solid, liquid, and gas. Today, that changed.\n\nAfter a nearly 20 year pursuit, we’ve created an entirely new state of matter, unlocked by a new class of materials, topoconductors, that enable a fundamental leap in computing.\n\nIt powers Majorana 1, the first quantum processing unit built on a topological core.\n\nWe believe this breakthrough will allow us to create a truly meaningful quantum computer not in decades, as some have predicted, but in years. \n\nThe qubits created with topoconductors are faster, more reliable, and smaller. \n\nThey are 1/100th of a millimeter, meaning we now have a clear path to a million-qubit processor. \n\nImagine a chip that can fit in the palm of your hand yet is capable of solving problems that even all the computers on Earth today combined could not! \n\nSometimes researchers have to work on things for decades to make progress possible.\n\nIt takes patience and persistence to have big impact in the world. \n\nAnd I am glad we get the opportunity to do just that at Microsoft. \n\nThis is our focus: When productivity rises, economies grow faster, benefiting every sector and every corner of the globe. \n\nIt’s not about hyping tech; it’s about building technology that truly serves the world. \n\nRead more about our discovery, and why it matters, here: https://aka.ms/AAu76rr",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290707",
    "published_date": "2025-06-02T19:31:20.290707",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290709"
  },
  {
    "id": "-2652299642118601055",
    "title": "Our new partnership with WSP will accelerate digital and AI transformation across the Architecture, ...",
    "content": "Our new partnership with WSP will accelerate digital and AI transformation across the Architecture, Engineering, and Construction industry.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290712",
    "published_date": "2025-06-02T19:31:20.290712",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290714"
  },
  {
    "id": "332825538864845237",
    "title": "Great to see so many customers and partners unlocking the full ROI of AI.",
    "content": "Great to see so many customers and partners unlocking the full ROI of AI.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290716",
    "published_date": "2025-06-02T19:31:20.290716",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290717"
  },
  {
    "id": "-3452571995500372597",
    "title": "GitHub Copilot is all-in on agents. Check out Agent Mode, and a first look at our Autonomous SWE age...",
    "content": "GitHub Copilot is all-in on agents. Check out Agent Mode, and a first look at our Autonomous SWE agent.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290720",
    "published_date": "2025-06-02T19:31:20.290720",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290721"
  },
  {
    "id": "4082331701908773270",
    "title": "o3-mini is here and ships today on Azure AI Foundry and GitHub Copilot and Models... can't wait to s...",
    "content": "o3-mini is here and ships today on Azure AI Foundry and GitHub Copilot and Models... can't wait to see what you build!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290723",
    "published_date": "2025-06-02T19:31:20.290723",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290725"
  },
  {
    "id": "291496531937325100",
    "title": "Jevons paradox strikes again! As AI gets more efficient and accessible, we will see its use skyrocke...",
    "content": "Jevons paradox strikes again! As AI gets more efficient and accessible, we will see its use skyrocket, turning it into a commodity we just can't get enough of.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290727",
    "published_date": "2025-06-02T19:31:20.290727",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290729"
  },
  {
    "id": "8773732599413727282",
    "title": "For me, cricket is maybe the only thing that could possibly come close to watching the Excel World C...",
    "content": "For me, cricket is maybe the only thing that could possibly come close to watching the Excel World Champ on ESPN! https://lnkd.in/gvdZV5JM",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290731",
    "published_date": "2025-06-02T19:31:20.290731",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290733"
  },
  {
    "id": "1038784576024748367",
    "title": "“Tokens per watt per dollar\"—the sweet spot where energy, compute power, and intelligence meet—will ...",
    "content": "“Tokens per watt per dollar\"—the sweet spot where energy, compute power, and intelligence meet—will be a game-changing formula for driving GDP growth. Great to chat about this with Nicholas Thompson today.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290735",
    "published_date": "2025-06-02T19:31:20.290735",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290737"
  },
  {
    "id": "2723738139678270659",
    "title": "Congratulations to President Trump and Vice President Vance on your historic inauguration. We look f...",
    "content": "Congratulations to President Trump and Vice President Vance on your historic inauguration. We look forward to partnering with you and your administration to harness the power of technology for growth and help drive America's competitiveness and leadership around the world.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290739",
    "published_date": "2025-06-02T19:31:20.290739",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290741"
  },
  {
    "id": "-5570161993188620069",
    "title": "Today in Nature Magazine: Our MatterGen model represents a paradigm shift in materials design, apply...",
    "content": "Today in Nature Magazine: Our MatterGen model represents a paradigm shift in materials design, applying generative AI to create new compounds with specific properties with unprecedented precision. Read more here: https://lnkd.in/gURKjUce",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290743",
    "published_date": "2025-06-02T19:31:20.290743",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290745"
  },
  {
    "id": "-2767519360448690560",
    "title": "Announcing Microsoft 365 Copilot Chat. Making AI more accessible to every employee in every business...",
    "content": "Announcing Microsoft 365 Copilot Chat. Making AI more accessible to every employee in every business.\n\nLearn more here: aka.ms/CopilotChat",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290747",
    "published_date": "2025-06-02T19:31:20.290747",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290748"
  },
  {
    "id": "4241034896684030902",
    "title": "The foundation models we'll build with Mayo Clinic promise to help transform how radiologists do the...",
    "content": "The foundation models we'll build with Mayo Clinic promise to help transform how radiologists do their work, using multimodal AI to help them analyze X-rays faster and more accurately.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290751",
    "published_date": "2025-06-02T19:31:20.290751",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290752"
  },
  {
    "id": "-4964033414589673764",
    "title": "There is no more waitlist for GitHub Copilot Workspace—the most advanced agentic editor. Start build...",
    "content": "There is no more waitlist for GitHub Copilot Workspace—the most advanced agentic editor. Start building with agents today. \n\nSign up here: https://lnkd.in/g9WCJZDd",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290755",
    "published_date": "2025-06-02T19:31:20.290755",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290756"
  },
  {
    "id": "6963061118836304715",
    "title": "Our hearts go out to everyone affected by the devastating fires in California.",
    "content": "Our hearts go out to everyone affected by the devastating fires in California.\nIn collaboration with Planet Labs, we leveraged our damage assessment AI models on high-resolution SkySat satellite imagery provided by Planet. This collaboration enabled us to map affected areas and generate critical insights to aid recovery efforts. These maps have been shared with organizations on the ground to assist in damage assessments and response planning.\n\nKey Findings from Los Angeles Imagery Analysis:\n\n17,835 buildings analyzed:\n\n6,251 are obscured by clouds, shadow, or smoke.\n9,229 are likely unaffected (as of 1/8, 2:21 PM PT).\n2,355 are likely affected by the fires.\n\nWe acknowledge that these fires are ongoing, and the presence of smoke and other obstructions may result in additional impacted buildings that are not yet detectable.\n\nThis analysis represents a portion of the Palisades fire; other fires in the region are not included in this assessment. While these insights offer a valuable initial overview, they remain preliminary and require on-the-ground verification for a comprehensive understanding of the damage.\n\nThe AI for Good Lab remains steadfast in its commitment to supporting affected communities during this challenging time. \n\nIf your organization would benefit from access to the underlying data in this report, please reach out to me. We are committed to sharing this information to support ongoing recovery efforts.\n\nExplore the data through this interactive visualizer:\n\n👉 https://lnkd.in/g6swWfh6",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290761",
    "published_date": "2025-06-02T19:31:20.290761",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290763"
  },
  {
    "id": "-8756578567881918088",
    "title": "Exciting to see the new RTX 50-series GPUs and Windows Subsystem for Linux powering models from Nvid...",
    "content": "Exciting to see the new RTX 50-series GPUs and Windows Subsystem for Linux powering models from Nvidia NIM and Azure AI Foundry on Windows 11 PCs. A game-changer for running AI on the edge.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290766",
    "published_date": "2025-06-02T19:31:20.290766",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290767"
  },
  {
    "id": "-7890589430034480729",
    "title": "It was great to meet the team at ADT Baramati today, who are using our AI tools to help farmers grow...",
    "content": "It was great to meet the team at ADT Baramati today, who are using our AI tools to help farmers grow healthier, more sustainable harvests.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290769",
    "published_date": "2025-06-02T19:31:20.290769",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290771"
  },
  {
    "id": "-1657753322301250258",
    "title": "Just in time for test-time scaling, we have our first NVlink 72 clusters live in Azure. Here’s to th...",
    "content": "Just in time for test-time scaling, we have our first NVlink 72 clusters live in Azure. Here’s to the next generation of AI built on these systems!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290773",
    "published_date": "2025-06-02T19:31:20.290773",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290775"
  },
  {
    "id": "-5775038148383340756",
    "title": "AI is already transforming the lives of people across India by creating new opportunities and jobs, ...",
    "content": "AI is already transforming the lives of people across India by creating new opportunities and jobs, as stories like Jui's, Raghavendra's, and Venkatesh's show. That's why we’re committed to helping to equip 10 million Indians with essential AI skills by 2030.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290778",
    "published_date": "2025-06-02T19:31:20.290778",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290780"
  },
  {
    "id": "-2913513766921961657",
    "title": "Thrilled to announce our new investments in AI infrastructure and skilling in India to help accelera...",
    "content": "Thrilled to announce our new investments in AI infrastructure and skilling in India to help accelerate the country’s AI transformation. https://lnkd.in/g5TYP7xJ",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290782",
    "published_date": "2025-06-02T19:31:20.290782",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290784"
  },
  {
    "id": "-6349352142523456596",
    "title": "Thank you, PM Narendra Modi ji for your leadership. Excited to build on our commitment to making Ind...",
    "content": "Thank you, PM Narendra Modi ji for your leadership. Excited to build on our commitment to making India AI-first and work together on our continued expansion in the country to ensure every Indian benefits from this AI platform shift.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290786",
    "published_date": "2025-06-02T19:31:20.290786",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290787"
  },
  {
    "id": "6089410301268938198",
    "title": "Every general-purpose technology creates new opportunity across the economy. But it requires compani...",
    "content": "Every general-purpose technology creates new opportunity across the economy. But it requires companies and countries to invest in new infrastructure and equip people with the right skills. And that’s what we are doing at Microsoft in this AI era, starting in the US.\n\nAs Brad Smith outlines, we want to ensure every American benefits from this AI platform shift, whether it is a scientist discovering a new drug or a high school grad launching a career in cyber security, a farmer embracing precision agriculture or a small business owner becoming more competitive.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290791",
    "published_date": "2025-06-02T19:31:20.290791",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290793"
  },
  {
    "id": "-3467959786612482576",
    "title": "GitHub Copilot Free for VS Code has arrived.",
    "content": "GitHub Copilot Free for VS Code has arrived.\n\nSign up today: https://lnkd.in/gdAcfCnm",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290797",
    "published_date": "2025-06-02T19:31:20.290797",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290799"
  },
  {
    "id": "1057965017161387361",
    "title": "The pace of AI innovation this past year has been truly remarkable. But looking back, what stands ou...",
    "content": "The pace of AI innovation this past year has been truly remarkable. But looking back, what stands out most is the incredible speed at which this technology has diffused, turning innovation into real impact—one person, one organization, one community at a time. \n\nAnd throughout 2024, I had the privilege of witnessing countless examples of this around the world.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290801",
    "published_date": "2025-06-02T19:31:20.290801",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290803"
  },
  {
    "id": "2584158911931590779",
    "title": "A true legend, Ustad Zakir Hussain, who brought immense joy through his rhythmic brilliance. Your mu...",
    "content": "A true legend, Ustad Zakir Hussain, who brought immense joy through his rhythmic brilliance. Your music transcends boundaries and will live on forever. #Legend #Alvida #MusicLivesOn",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290805",
    "published_date": "2025-06-02T19:31:20.290805",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [
      "Legend",
      "Alvida",
      "MusicLivesOn"
    ],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290810"
  },
  {
    "id": "2696334926470946407",
    "title": "I just loved this example our healthcare team shared at a recent radiology conference about the powe...",
    "content": "I just loved this example our healthcare team shared at a recent radiology conference about the power of Microsoft 365 Copilot to transform work and workflow. \n\nIn this case, it's a team of radiologists preparing for a tumor board meeting, helping them to create a draft agenda, take notes, write a teaching file, and then pull together a presentation. And we're seeing real world examples like this one across every sector.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290812",
    "published_date": "2025-06-02T19:31:20.290812",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290814"
  },
  {
    "id": "-8721038162200451814",
    "title": "Agents in Microsoft 365 Copilot work with you and on your behalf, breaking down silos across your bu...",
    "content": "Agents in Microsoft 365 Copilot work with you and on your behalf, breaking down silos across your business applications.\n\nAnd it's fantastic to see how our partners like Adobe, SAP, ServiceNow, and more are building agents to bring their unique knowledge right into the flow of your work and transform every business process and function, from HR and finance to sales.\n\nThe notion that you have go to siloed, bespoke business applications one at a time will be a thing of the past. \n\nYou can see this in action below, and learn more here: https://lnkd.in/dF9hZ2RQ",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290817",
    "published_date": "2025-06-02T19:31:20.290817",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290819"
  },
  {
    "id": "-547999974644981664",
    "title": "🚀 Phi-4 is here! A small language model that performs as well as (and often better than) large model...",
    "content": "🚀 Phi-4 is here! A small language model that performs as well as (and often better than) large models on certain types of complex reasoning tasks such as math. Useful for us in @MSFTResearch, and available now for all researcher on the Azure AI Foundry! https://aka.ms/phi4blog",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290823",
    "published_date": "2025-06-02T19:31:20.290823",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290825"
  },
  {
    "id": "342460061937779526",
    "title": "There's so much to love about Copilot, but Copilot Voice is a standout for me. Voice is more than a ...",
    "content": "There's so much to love about Copilot, but Copilot Voice is a standout for me. Voice is more than a modality. It's quick, intuitive, natural, and even changes its tone depending on how you interact with it. It fundamentally changes how we connect with technology in this new age of AI. Try it for yourself: https://lnkd.in/gFdCwfwB",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290827",
    "published_date": "2025-06-02T19:31:20.290827",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290829"
  },
  {
    "id": "-5520274987593699951",
    "title": "Proud of the depth and breadth of contributions from Microsoft researchers at this year's NeurIPS!",
    "content": "Proud of the depth and breadth of contributions from Microsoft researchers at this year's NeurIPS!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290831",
    "published_date": "2025-06-02T19:31:20.290831",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290832"
  },
  {
    "id": "-6676302948709400322",
    "title": "One of my favorite examples of how Copilot is transforming work is Copilot in Excel. You start with ...",
    "content": "One of my favorite examples of how Copilot is transforming work is Copilot in Excel. You start with a high-level prompt, and Copilot uses advanced reasoning capabilities to build out a full plan. Just like how Excel improved population-scale number-sense, we think Copilot in Excel with Python will improve analysis-sense for the world. \n\nTry it for yourself: https://lnkd.in/gT7DiRR9",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290835",
    "published_date": "2025-06-02T19:31:20.290835",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290837"
  },
  {
    "id": "-6228028363171802833",
    "title": "Maybe you shouldn't play favorites with features, but Copilot Vision is an update I've been excited ...",
    "content": "Maybe you shouldn't play favorites with features, but Copilot Vision is an update I've been excited about since day one. It's the first AI experience of its kind—now you can show, not tell, AI what you want help with in real time as you scroll. The goal is less time explaining yourself and more helpful interactions, all with privacy and control. \n\nWe've been working with a small group of early testers, and today we're rolling it out via Copilot Labs to get more feedback. I'm excited to hear from users how we can make Vision better, plus get inspired by the creative ways they use it. One I'm borrowing from an early tester—chess coaching! (I could use the help.) Another one we tried out in the video below, and more details on today's blog: https://lnkd.in/eDNAhB9F",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290840",
    "published_date": "2025-06-02T19:31:20.290840",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290842"
  },
  {
    "id": "3607620762482717336",
    "title": "I've been using Copilot Pages to prepare for meetings and it's been a game changer for me and my tea...",
    "content": "I've been using Copilot Pages to prepare for meetings and it's been a game changer for me and my team. It puts all of us on the same \"page\" before, during and after meetings, creates a first draft of our agenda and meeting notes, and can be shared in real-time with everyone involved, enabling us to ideate with AI and collaborate with each other.\n\nIt's pretty magical. Here's how to try it out: https://lnkd.in/gGFjUmBT",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290844",
    "published_date": "2025-06-02T19:31:20.290844",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290846"
  },
  {
    "id": "4197827899040723784",
    "title": "We have always been a platform- and partner-first company. And today we are building three trusted p...",
    "content": "We have always been a platform- and partner-first company. And today we are building three trusted platforms to help you maximize your opportunity in this age of AI. Here are some highlights from my keynote this morning at #MSIgnite.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290848",
    "published_date": "2025-06-02T19:31:20.290848",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [
      "MSIgnite"
    ],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290850"
  },
  {
    "id": "-2535233657172756401",
    "title": "AI is the new input for every company to expand their output, and the rapid adoption of this technol...",
    "content": "AI is the new input for every company to expand their output, and the rapid adoption of this technology and the intensity of its everyday use are the most important ways companies can get ahead today. Here are highlights from my keynote at #MSIgnite.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290852",
    "published_date": "2025-06-02T19:31:20.290852",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [
      "MSIgnite"
    ],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290854"
  },
  {
    "id": "-247397375421104845",
    "title": "Putting final touches on tomorrow’s Microsoft Ignite keynote, and the excitement is real! Events lik...",
    "content": "Putting final touches on tomorrow’s Microsoft Ignite keynote, and the excitement is real! Events like this always bring incredible energy, especially during platform shifts as big as this one. I’ve seen a few in my career, but the scale of this technology and the speed at which it is being diffused stand out.\n\nOf course, tech isn’t about tech for its own sake but about translating it into real outcomes, and it’s been remarkable to see so many of our customers and partners do just that. Tomorrow, you’ll see how we are going further, delivering three trusted platforms for the AI age—Copilot, Copilot devices, and Copilot & AI stack—that are helping people and organizations everywhere turn this powerful new input into higher value output. \n \nTune in tomorrow to watch live!",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290857",
    "published_date": "2025-06-02T19:31:20.290857",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290859"
  },
  {
    "id": "-9039614211170861514",
    "title": "NASA's repository of geospatial data contains key insights on everything from climate and air qualit...",
    "content": "NASA's repository of geospatial data contains key insights on everything from climate and air quality to urban planning and disaster response—but its scale and complexity make it difficult to parse. With Earth Copilot, they're making it easier than ever for anyone to access and navigate that data using natural language: https://lnkd.in/ga8ieYNa",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290861",
    "published_date": "2025-06-02T19:31:20.290861",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290863"
  },
  {
    "id": "-790779117613587933",
    "title": "We're committed to providing AI models that address the specific needs of our customers across indus...",
    "content": "We're committed to providing AI models that address the specific needs of our customers across industries. That's why today we're bringing new, adapted AI models to Azure AI with partners spanning a range of industries, from agriculture and automotive to manufacturing.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290865",
    "published_date": "2025-06-02T19:31:20.290865",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290867"
  },
  {
    "id": "2597915320322953374",
    "title": "It's fantastic to see how all of these organizations are adopting Copilot and Azure AI to adapt and ...",
    "content": "It's fantastic to see how all of these organizations are adopting Copilot and Azure AI to adapt and thrive in this new age of AI. From Siemens, which is reducing downtime, to Providence, which is improving care quality and decreasing physicians' administrative workloads, to the University of South Florida, which is alleviating the burden of time-consuming tasks for faculty and staff, organizations of every size, in every industry, are using AI as a new input to expand their output.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290869",
    "published_date": "2025-06-02T19:31:20.290869",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290871"
  },
  {
    "id": "-1974536919768251443",
    "title": "Congratulations President Trump, we’re looking forward to engaging with you and your administration ...",
    "content": "Congratulations President Trump, we’re looking forward to engaging with you and your administration to drive innovation forward that creates new growth and opportunity for the United States and the world.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290873",
    "published_date": "2025-06-02T19:31:20.290873",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290874"
  },
  {
    "id": "4884659543292944126",
    "title": "Appreciated this reflection by Brad Smith about AI's role as a general purpose technology, and how c...",
    "content": "Appreciated this reflection by Brad Smith about AI's role as a general purpose technology, and how countries that accelerate its diffusion will be best positioned to expand access to opportunity and drive economic growth.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290876",
    "published_date": "2025-06-02T19:31:20.290876",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290878"
  },
  {
    "id": "8244450953803148568",
    "title": "It's great to see all the exciting announcements coming out of LinkedIn Talent Connect, including ou...",
    "content": "It's great to see all the exciting announcements coming out of LinkedIn Talent Connect, including our new LinkedIn Hiring Assistant, an AI agent that will help recruiters harness the power of AI to find and hire qualified candidates faster and reduce the time they spend on repetitive, mundane tasks.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290880",
    "published_date": "2025-06-02T19:31:20.290880",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290882"
  },
  {
    "id": "-1140846324751955550",
    "title": "Developers are the architects of the AI era. Our latest Octoverse report shows the diffusion of AI e...",
    "content": "Developers are the architects of the AI era. Our latest Octoverse report shows the diffusion of AI everywhere, and how it's enabling more people than ever to join our global developer community. https://lnkd.in/gEDndcKF",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290884",
    "published_date": "2025-06-02T19:31:20.290884",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290885"
  },
  {
    "id": "1989746696393890268",
    "title": "We're building on the open platform ethos of GitHub, bringing multi-model choice to Copilot and intr...",
    "content": "We're building on the open platform ethos of GitHub, bringing multi-model choice to Copilot and introducing GitHub Spark, a new AI-native tool to build apps entirely in natural language.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290887",
    "published_date": "2025-06-02T19:31:20.290887",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290889"
  },
  {
    "id": "-8434393720629545725",
    "title": "Today, I shared my annual letter to shareholders, and I invite you to read it. I've been reflecting ...",
    "content": "Today, I shared my annual letter to shareholders, and I invite you to read it. I've been reflecting on how we stay relevant and continue reinventing ourselves in this age of AI. This includes our deep commitment to security, quality, and AI innovation – for our customers and the world.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290891",
    "published_date": "2025-06-02T19:31:20.290891",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290893"
  },
  {
    "id": "2073175064873789802",
    "title": "In Berlin today, I saw how Siemens Industrial Copilot is helping thyssenkrupp address the growing sk...",
    "content": "In Berlin today, I saw how Siemens Industrial Copilot is helping thyssenkrupp address the growing skilled labor gap in manufacturing – and drive new growth for the company.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290895",
    "published_date": "2025-06-02T19:31:20.290895",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290897"
  },
  {
    "id": "-8336850422943439423",
    "title": "It was great to see firsthand in Rome today this example of how the city is using AI to help provide...",
    "content": "It was great to see firsthand in Rome today this example of how the city is using AI to help provide reliable services and information to tourists, in preparation for the 2025 Jubilee.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290899",
    "published_date": "2025-06-02T19:31:20.290899",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290900"
  },
  {
    "id": "4457850376467667941",
    "title": "It was energizing to meet with researchers at Institut Curie today to talk about how AI is accelerat...",
    "content": "It was energizing to meet with researchers at Institut Curie today to talk about how AI is accelerating the pace of science—and how they are using Copilot to transform their day-to-day work.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290902",
    "published_date": "2025-06-02T19:31:20.290902",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290904"
  },
  {
    "id": "-3335111840291598456",
    "title": "I am thrilled to announce a five-year agreement between Microsoft and the UK Government. This partne...",
    "content": "I am thrilled to announce a five-year agreement between Microsoft and the UK Government. This partnership empowers public sector organizations by providing enhanced access to our AI-powered products and services, significantly advancing their digital transformation journeys. Together with Crown Commercial Service, we aim to drive innovation and transformation across the public sector, ensuring better outcomes for citizens and stakeholders alike.\n\nWith research from Public First projecting that faster adoption of digital technologies could add £550bn to the UK’s GDP by 2035, this collaboration represents a pivotal step in shaping a more innovative and efficient public sector. By providing the tools to innovate faster and operate more efficiently, we’re proud to support the UK in this critical era of technological advancement!\n\nThis is a significant milestone—not only for the UK’s public sector but also for Microsoft’s ongoing commitment to leveraging AI to unlock new possibilities across industries and regions. Looking forward to the impact this partnership will have on the future of public services. Thanks to all involved. \n\nRoger Gonourie, David Knott, Clare G., Jay Chinnadorai, Samantha Ulyatt FCIPS, Catherine Little, Sarah Munby, Cabinet Office, Department for Science, Innovation and Technology, Judson Althoff, Scott Guthrie, John Giannone, Kevin Scott, Angela Heise, Derrick McCourt, Clare Barclay, Mike Peers\n\nhttps://lnkd.in/ge5vpp-2\n\n#AITransformation #InnovationLeadership #MicrosoftPartnerships",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290908",
    "published_date": "2025-06-02T19:31:20.290908",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [
      "AITransformation",
      "InnovationLeadership",
      "MicrosoftPartnerships"
    ],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290911"
  },
  {
    "id": "2777301584231846570",
    "title": "Across Microsoft, teams are adopting Copilot to drive growth, optimize costs, and better meet custom...",
    "content": "Across Microsoft, teams are adopting Copilot to drive growth, optimize costs, and better meet customer needs.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290913",
    "published_date": "2025-06-02T19:31:20.290913",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290915"
  },
  {
    "id": "8624324567386268414",
    "title": "Copilot is the UI for AI, and with Copilot Studio, customers can easily create, manage, and connect ...",
    "content": "Copilot is the UI for AI, and with Copilot Studio, customers can easily create, manage, and connect agents to Copilot.\n \nToday we announced new autonomous agent capabilities across Copilot Studio and Dynamics 365 to help scale the impact of every individual, team, and business function.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290917",
    "published_date": "2025-06-02T19:31:20.290917",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290919"
  },
  {
    "id": "-1204126289996183252",
    "title": "Proud of this work to improve disability representation in the datasets used to train AI. Our new co...",
    "content": "Proud of this work to improve disability representation in the datasets used to train AI. Our new collaboration will broaden the diversity of AI data, and help make AI more useful for the blind and low vision community.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290921",
    "published_date": "2025-06-02T19:31:20.290921",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290923"
  },
  {
    "id": "8672245958485700038",
    "title": "It's great to see how customers around the world are already using our Cobalt VMs to achieve up to 5...",
    "content": "It's great to see how customers around the world are already using our Cobalt VMs to achieve up to 50% better price-performance.",
    "platform": "linkedin",
    "status": "published",
    "created_date": "2025-06-02T19:31:20.290925",
    "published_date": "2025-06-02T19:31:20.290925",
    "engagement": {
      "likes": 0,
      "comments": 0,
      "shares": 0,
      "views": 0
    },
    "tags": [],
    "source": "scraped",
    "scraped_at": "2025-06-02T19:31:20.290926"
  }
]